# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.



words = ['a', 'word', 4, {5}, 8.2, [345], True]
for word in words:
  print(f'{word} - {type(word)}')










