# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.


months = input('введите число от 1 до 12: ')
if 0 < int(months) <= 12:
    season = ['зима', 'весна', 'лето', 'осень', 'зима']
    seasons_2 = {0: 'зима', 1: 'весна', 2: 'лето', 3: 'осень', 4: 'зима'}
    print(f'Сезон - {season[int(months) // 3]}')
    print(f'Cловарь сезонов - {seasons_2[int(months) // 3]}')
else:
    print('ошибка')



month = int(input('введите месяц: '))
if 0 < month <=12:
    seasons_2 = {'зима': [12, 1, 2],
                 'весна': [3, 4, 5],
                 'лето': [6, 7, 8],
                 'осень': [9, 10, 11]}
    for season in seasons_2:
        if month in seasons_2[season]:
            print(season)
else:
    print('ошибка')



















